app/controllers/events_controller.rb

INSERT INTO "events" ("e_name", "e_key", "e_detail", "e_host", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["e_name", "aaaa"], ["e_key", "aaaa"], ["e_detail", "sample"], ["e_host", "sample@gmail.com"], ["created_at", "2015-10-31 16:36:18.466108"], ["updated_at", "2015-10-31 16:36:18.466108"]]
---
  def plan
    param = params[:event]
    if param[:e_key] != nil and param[:e_name] != nil then
        @event = Event.new
        @event.e_name = param[:e_name]
        @event.e_key = param[:e_key]
        @event.e_detail = param[:e_detail]
        @event.e_location = param[:e_location]
        @event.e_host = current_user.email
        @event.save

SELECT "events".* FROM "events" WHERE "events"."e_key" = ?  [["e_key", "sample"]]
---
  def event_detail
    @event = Event.where(e_key: params[:e_key])