app/controllers/home_controller.rb

SELECT "items".* FROM "items"
---
  def items
    @items = Item.all