app/controllers/home_controller.rb

  def items
    @a_right = false
    if params[:e_key] != nil then
        @items = Item.where(e_key: params[:e_key])
        host = Event.find_by(e_key: params[:e_key])
---
SELECT "items".* FROM "items" WHERE "items"."e_key" = ?  [["e_key", "er"]]
SELECT  "events".* FROM "events" WHERE "events"."e_key" = ?  ORDER BY "events"."id" ASC LIMIT 1  [["e_key", "sample"]]

  def get_image
    image = Item.where(id: params[:id]).first
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ?  ORDER BY "items"."id" ASC LIMIT 1  [["id", 5]]

  def item_detail
    @item = Item.where(id: params[:id]).first
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ?  ORDER BY "items"."id" ASC LIMIT 1  [["id", 16]]

  def delete
    del_item = Item.where(id: params[:id])
    del_item.delete_all
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ?  ORDER BY "items"."id" ASC LIMIT 1  [["id", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]