app/controllers/up_on_browser_controller.rb

INSERT INTO "items" ("i_name", "category", "pic_data", "e_key", "f_name", "f_id", "i_detail", "pos_x", "pos_y", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
      param = params[:item]
      @item = Item.new
      @item.i_name = param[:i_name]
      @item.category = param[:category]
      @item.pic_data = param[:pic_data].read
      @item.e_key = param[:e_key]
      @item.f_name = current_user.email
      @item.f_id = current_user.id
      @item.save